rockaport/efm32-base/sdk/platform/bootloader/core/GCC/main_btl_startup.c
  /* External interrupts */
#if defined(BOOTLOADER_USE_INTERRUPTS)
#if defined(_EFR_DEVICE) && defined(_SILICON_LABS_32B_SERIES_1_CONFIG_1)
  // EFR32xG1
  EMU_IRQHandler,                           /*  0  - EMU                      */
  FRC_PRI_IRQHandler,                       /*  1  - FRC_PRI                  */
  WDOG0_IRQHandler,                         /*  2  - WDOG0                    */
  FRC_IRQHandler,                           /*  3  - FRC                      */
  MODEM_IRQHandler,                         /*  4  - MODEM                    */
  RAC_SEQ_IRQHandler,                       /*  5  - RAC_SEQ                  */
  RAC_RSM_IRQHandler,                       /*  6  - RAC_RSM                  */
  BUFC_IRQHandler,                          /*  7  - BUFC                     */
  LDMA_IRQHandler,                          /*  8  - LDMA                     */
  GPIO_EVEN_IRQHandler,                     /*  9  - GPIO_EVEN                */
  TIMER0_IRQHandler,                        /*  10 - TIMER0                   */
  USART0_RX_IRQHandler,                     /*  11 - USART0_RX                */
  USART0_TX_IRQHandler,                     /*  12 - USART0_TX                */
  ACMP0_IRQHandler,                         /*  13 - ACMP0                    */
  ADC0_IRQHandler,                          /*  14 - ADC0                     */
  IDAC0_IRQHandler,                         /*  15 - IDAC0                    */
  I2C0_IRQHandler,                          /*  16 - I2C0                     */
  GPIO_ODD_IRQHandler,                      /*  17 - GPIO_ODD                 */
  TIMER1_IRQHandler,                        /*  18 - TIMER1                   */
  USART1_RX_IRQHandler,                     /*  19 - USART1_RX                */
  USART1_TX_IRQHandler,                     /*  20 - USART1_TX                */
  LEUART0_IRQHandler,                       /*  21 - LEUART0                  */
  PCNT0_IRQHandler,                         /*  22 - PCNT0                    */
  CMU_IRQHandler,                           /*  23 - CMU                      */
  MSC_IRQHandler,                           /*  24 - MSC                      */
  CRYPTO_IRQHandler,                        /*  25 - CRYPTO                   */
  LETIMER0_IRQHandler,                      /*  26 - LETIMER0                 */
  AGC_IRQHandler,                           /*  27 - AGC                      */
  PROTIMER_IRQHandler,                      /*  28 - PROTIMER                 */
  RTCC_IRQHandler,                          /*  29 - RTCC                     */
  SYNTH_IRQHandler,                         /*  30 - SYNTH                    */
  CRYOTIMER_IRQHandler,                     /*  31 - CRYOTIMER                */
  RFSENSE_IRQHandler,                       /*  32 - RFSENSE                  */
  FPUEH_IRQHandler,                         /*  33 - FPUEH                    */
#elif defined(_EFR_DEVICE) && defined(_SILICON_LABS_32B_SERIES_1_CONFIG_2)
  // EFR32xG12
  EMU_IRQHandler,                           /*  0  - EMU                      */
  FRC_PRI_IRQHandler,                       /*  1  - FRC_PRI                  */
  WDOG0_IRQHandler,                         /*  2  - WDOG0                    */
  WDOG1_IRQHandler,                         /*  3  - WDOG1                    */
  FRC_IRQHandler,                           /*  4  - FRC                      */
  MODEM_IRQHandler,                         /*  5  - MODEM                    */
  RAC_SEQ_IRQHandler,                       /*  6  - RAC_SEQ                  */
  RAC_RSM_IRQHandler,                       /*  7  - RAC_RSM                  */
  BUFC_IRQHandler,                          /*  8  - BUFC                     */
  LDMA_IRQHandler,                          /*  9  - LDMA                     */
  GPIO_EVEN_IRQHandler,                     /*  10 - GPIO_EVEN                */
  TIMER0_IRQHandler,                        /*  11 - TIMER0                   */
  USART0_RX_IRQHandler,                     /*  12 - USART0_RX                */
  USART0_TX_IRQHandler,                     /*  13 - USART0_TX                */
  ACMP0_IRQHandler,                         /*  14 - ACMP0                    */
  ADC0_IRQHandler,                          /*  15 - ADC0                     */
  IDAC0_IRQHandler,                         /*  16 - IDAC0                    */
  I2C0_IRQHandler,                          /*  17 - I2C0                     */
  GPIO_ODD_IRQHandler,                      /*  18 - GPIO_ODD                 */
  TIMER1_IRQHandler,                        /*  19 - TIMER1                   */
  USART1_RX_IRQHandler,                     /*  20 - USART1_RX                */
  USART1_TX_IRQHandler,                     /*  21 - USART1_TX                */
  LEUART0_IRQHandler,                       /*  22 - LEUART0                  */
  PCNT0_IRQHandler,                         /*  23 - PCNT0                    */
  CMU_IRQHandler,                           /*  24 - CMU                      */
  MSC_IRQHandler,                           /*  25 - MSC                      */
  CRYPTO0_IRQHandler,                       /*  26 - CRYPTO0                  */
  LETIMER0_IRQHandler,                      /*  27 - LETIMER0                 */
  AGC_IRQHandler,                           /*  28 - AGC                      */
  PROTIMER_IRQHandler,                      /*  29 - PROTIMER                 */
  RTCC_IRQHandler,                          /*  30 - RTCC                     */
  SYNTH_IRQHandler,                         /*  31 - SYNTH                    */
  CRYOTIMER_IRQHandler,                     /*  32 - CRYOTIMER                */
  RFSENSE_IRQHandler,                       /*  33 - RFSENSE                  */
  FPUEH_IRQHandler,                         /*  34 - FPUEH                    */
  SMU_IRQHandler,                           /*  35 - SMU                      */
  WTIMER0_IRQHandler,                       /*  36 - WTIMER0                  */
  WTIMER1_IRQHandler,                       /*  37 - WTIMER1                  */
  PCNT1_IRQHandler,                         /*  38 - PCNT1                    */
  PCNT2_IRQHandler,                         /*  39 - PCNT2                    */
  USART2_RX_IRQHandler,                     /*  40 - USART2_RX                */
  USART2_TX_IRQHandler,                     /*  41 - USART2_TX                */
  I2C1_IRQHandler,                          /*  42 - I2C1                     */
  USART3_RX_IRQHandler,                     /*  43 - USART3_RX                */
  USART3_TX_IRQHandler,                     /*  44 - USART3_TX                */
  VDAC0_IRQHandler,                         /*  45 - VDAC0                    */
  CSEN_IRQHandler,                          /*  46 - CSEN                     */
  LESENSE_IRQHandler,                       /*  47 - LESENSE                  */
  CRYPTO1_IRQHandler,                       /*  48 - CRYPTO1                  */
  TRNG0_IRQHandler,                         /*  49 - TRNG0                    */
  Default_Handler,                          /*  50 - Reserved                 */
#elif defined(_EFR_DEVICE) && defined(_SILICON_LABS_32B_SERIES_1_CONFIG_3)
  // EFR32xG13
  EMU_IRQHandler,                           /*  0  - EMU                      */
  FRC_PRI_IRQHandler,                       /*  1  - FRC_PRI                  */
  WDOG0_IRQHandler,                         /*  2  - WDOG0                    */
  WDOG1_IRQHandler,                         /*  3  - WDOG1                    */
  FRC_IRQHandler,                           /*  4  - FRC                      */
  MODEM_IRQHandler,                         /*  5  - MODEM                    */
  RAC_SEQ_IRQHandler,                       /*  6  - RAC_SEQ                  */
  RAC_RSM_IRQHandler,                       /*  7  - RAC_RSM                  */
  BUFC_IRQHandler,                          /*  8  - BUFC                     */
  LDMA_IRQHandler,                          /*  9  - LDMA                     */
  GPIO_EVEN_IRQHandler,                     /*  10 - GPIO_EVEN                */
  TIMER0_IRQHandler,                        /*  11 - TIMER0                   */
  USART0_RX_IRQHandler,                     /*  12 - USART0_RX                */
  USART0_TX_IRQHandler,                     /*  13 - USART0_TX                */
  ACMP0_IRQHandler,                         /*  14 - ACMP0                    */
  ADC0_IRQHandler,                          /*  15 - ADC0                     */
  IDAC0_IRQHandler,                         /*  16 - IDAC0                    */
  I2C0_IRQHandler,                          /*  17 - I2C0                     */
  GPIO_ODD_IRQHandler,                      /*  18 - GPIO_ODD                 */
  TIMER1_IRQHandler,                        /*  19 - TIMER1                   */
  USART1_RX_IRQHandler,                     /*  20 - USART1_RX                */
  USART1_TX_IRQHandler,                     /*  21 - USART1_TX                */
  LEUART0_IRQHandler,                       /*  22 - LEUART0                  */
  PCNT0_IRQHandler,                         /*  23 - PCNT0                    */
  CMU_IRQHandler,                           /*  24 - CMU                      */
  MSC_IRQHandler,                           /*  25 - MSC                      */
  CRYPTO0_IRQHandler,                       /*  26 - CRYPTO0                  */
  LETIMER0_IRQHandler,                      /*  27 - LETIMER0                 */
  AGC_IRQHandler,                           /*  28 - AGC                      */
  PROTIMER_IRQHandler,                      /*  29 - PROTIMER                 */
  PRORTC_IRQHandler,                        /*  30 - PRORTC                   */
  RTCC_IRQHandler,                          /*  31 - RTCC                     */
  SYNTH_IRQHandler,                         /*  32 - SYNTH                    */
  CRYOTIMER_IRQHandler,                     /*  33 - CRYOTIMER                */
  RFSENSE_IRQHandler,                       /*  34 - RFSENSE                  */
  FPUEH_IRQHandler,                         /*  35 - FPUEH                    */
  SMU_IRQHandler,                           /*  36 - SMU                      */
  WTIMER0_IRQHandler,                       /*  37 - WTIMER0                  */
  USART2_RX_IRQHandler,                     /*  38 - USART2_RX                */
  USART2_TX_IRQHandler,                     /*  39 - USART2_TX                */
  I2C1_IRQHandler,                          /*  40 - I2C1                     */
  VDAC0_IRQHandler,                         /*  41 - VDAC0                    */
  CSEN_IRQHandler,                          /*  42 - CSEN                     */
  LESENSE_IRQHandler,                       /*  43 - LESENSE                  */
  CRYPTO1_IRQHandler,                       /*  44 - CRYPTO1                  */
  TRNG0_IRQHandler,                         /*  45 - TRNG0                    */
  Default_Handler,                          /*  46 - Reserved                 */
#else
#error "Bootloader needs interrupts, but no ISRs are defined."
#endif
#endif
};

/*----------------------------------------------------------------------------
 * Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
void Reset_Handler(void)
{
  uint32_t *pSrc, *pDest;
  uint32_t *pTable __attribute__((unused));

#ifndef __NO_SYSTEM_INIT
  SystemInit();
#endif
  SystemInit2();

